ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/cc1352_jtag.c
#include "cc1352_jtag.h"

#include <errno.h>
#include <zephyr/device.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/kernel.h>
#include <hardware/gpio.h>
#include <hardware/structs/sio.h>

#define CC1352_JRC_IDCODE_MASK  0x0fffffffu
#define CC1352_JRC_IDCODE_VAL   0x1bb7702fu
#define CC1352_JRC_IDCODE_CORE  0x0bb7702fu
#define ARM_DAP_IDCODE_VAL     0x4ba00477u

#define TAP_CPU_IRLEN 4
#define TAP_JRC_IRLEN 6
#define TAP_MAX 2

#define IR_JRC_IF_BYPASS 0x3f
#define IR_JRC_IDCODE    0x04
#define IR_JRC_ROUTER    0x02
#define IR_JRC_CONNECT   0x07
#define IR_JRC_BYPASS    0x00

#define IR_ARM_DPACC     0x0a
#define IR_ARM_APACC     0x0b
#define IR_ARM_IDCODE    0x0e
#define IR_ARM_BYPASS    0x0f

#define DP_ADDR_ABORT    0x0
#define DP_ADDR_CTRLSTAT 0x4
#define DP_ADDR_SELECT   0x8
#define DP_ADDR_RDBUFF   0xc

#define AP_ADDR_CSW      0x00
#define AP_ADDR_TAR      0x04
#define AP_ADDR_DRW      0x0c

#define CTRLSTAT_CSYSPWRUPREQ BIT(30)
#define CTRLSTAT_CSYSPWRUPACK BIT(31)
#define CTRLSTAT_CDBGPWRUPREQ BIT(28)
#define CTRLSTAT_CDBGPWRUPACK BIT(29)

#define DHCSR_ADDR 0xe000edf0u
#define DHCSR_DBGKEY 0xa05f0000u
#define DHCSR_C_DEBUGEN BIT(0)
#define DHCSR_C_HALT BIT(1)
#define DHCSR_S_HALT BIT(17)
#define JTAG_EDGE_DELAY_US 1

enum jtag_state {
	JTAG_TLR = 0,
	JTAG_RTI,
	JTAG_SD,
	JTAG_CD,
	JTAG_SHD,
	JTAG_E1D,
	JTAG_PD,
	JTAG_E2D,
	JTAG_UD,
	JTAG_SI,
	JTAG_CI,
	JTAG_SHI,
	JTAG_E1I,
	JTAG_PI,
	JTAG_E2I,
	JTAG_UI,
};

struct chain_desc {
	int taps;
	int ir_len[TAP_MAX];
	int cpu_index;
	int jrc_index;
};

struct jtag_ctx {
	struct gpio_dt_spec tck;
	struct gpio_dt_spec tms;
	struct gpio_dt_spec tdi;
	struct gpio_dt_spec tdo;
	struct gpio_dt_spec reset_a;
	struct gpio_dt_spec reset_b;
	uint tck_pin;
	uint tms_pin;
	uint tdi_pin;
	uint tdo_pin;
	uint32_t tck_mask;
	uint32_t tms_mask;
	uint32_t tdi_mask;
	uint32_t tdo_mask;
	uint reset_a_pin;
	uint reset_b_pin;
	uint reset_ctrl_pin;
	uint reset_obs_pin;
	uint8_t reset_ctrl_out_level;
	bool pins_ready;
	enum jtag_state state;

	bool switched_to_4wire;
	bool cpu_tap_enabled;
	bool chain_detected;
	struct chain_desc chain;
	uint32_t jrc_idcode;
	uint32_t cpu_idcode;
	uint32_t last_dhcsr;
	bool data_pins_swapped;
	bool reset_active_low;
	uint8_t reset_source;
};

static struct jtag_ctx g_ctx = {
	.state = JTAG_TLR,
};

static const struct gpio_dt_spec cjtag_tck = GPIO_DT_SPEC_GET(DT_ALIAS(cjtag0), gpios);
static const struct gpio_dt_spec cjtag_tms = GPIO_DT_SPEC_GET(DT_ALIAS(cjtag1), gpios);
static const struct gpio_dt_spec cjtag_tdi = GPIO_DT_SPEC_GET(DT_ALIAS(cjtag2), gpios);
static const struct gpio_dt_spec cjtag_tdo = GPIO_DT_SPEC_GET(DT_ALIAS(cjtag3), gpios);
static const struct gpio_dt_spec cc1352_reset_a = GPIO_DT_SPEC_GET(DT_ALIAS(pin_reset), gpios);
static const struct gpio_dt_spec cc1352_reset_b = GPIO_DT_SPEC_GET(DT_ALIAS(cjtag_reset), gpios);

static int jtag_select_reset_source(uint8_t source)
{
	/* source: 0 -> pin_reset alias, 1 -> cjtag_reset alias */
	if (source == 0) {
		g_ctx.reset_source = 0;
		g_ctx.reset_ctrl_pin = g_ctx.reset_a_pin;
		g_ctx.reset_obs_pin = g_ctx.reset_b_pin;
	} else {
		g_ctx.reset_source = 1;
		g_ctx.reset_ctrl_pin = g_ctx.reset_b_pin;
		g_ctx.reset_obs_pin = g_ctx.reset_a_pin;
	}

	gpio_init(g_ctx.reset_ctrl_pin);
	gpio_set_function(g_ctx.reset_ctrl_pin, GPIO_FUNC_SIO);
	gpio_disable_pulls(g_ctx.reset_ctrl_pin);
	gpio_set_input_enabled(g_ctx.reset_ctrl_pin, false);
	gpio_set_dir(g_ctx.reset_ctrl_pin, GPIO_OUT);
	gpio_put(g_ctx.reset_ctrl_pin, 1);
	g_ctx.reset_ctrl_out_level = 1;

	gpio_init(g_ctx.reset_obs_pin);
	gpio_set_function(g_ctx.reset_obs_pin, GPIO_FUNC_SIO);
	gpio_disable_pulls(g_ctx.reset_obs_pin);
	gpio_set_input_enabled(g_ctx.reset_obs_pin, true);
	gpio_set_dir(g_ctx.reset_obs_pin, GPIO_IN);
	return 0;
}

static int jtag_apply_data_pins(uint tdi_pin, uint tdo_pin)
{
	if (tdi_pin == tdo_pin) {
		return -EINVAL;
	}

	g_ctx.tdi_pin = tdi_pin;
	g_ctx.tdo_pin = tdo_pin;
	g_ctx.tdi_mask = 1u << tdi_pin;
	g_ctx.tdo_mask = 1u << tdo_pin;

	gpio_init(g_ctx.tdi_pin);
	gpio_set_function(g_ctx.tdi_pin, GPIO_FUNC_SIO);
	gpio_pull_up(g_ctx.tdi_pin);
	gpio_set_input_enabled(g_ctx.tdi_pin, false);
	gpio_set_dir(g_ctx.tdi_pin, GPIO_OUT);
	gpio_put(g_ctx.tdi_pin, 1);

	gpio_init(g_ctx.tdo_pin);
	gpio_set_function(g_ctx.tdo_pin, GPIO_FUNC_SIO);
	gpio_disable_pulls(g_ctx.tdo_pin);
	gpio_set_input_enabled(g_ctx.tdo_pin, true);
	gpio_set_dir(g_ctx.tdo_pin, GPIO_IN);

	return 0;
}

static int jtag_config_data_pins(bool swap_data)
{
	uint tdi_pin = swap_data ? (uint)cjtag_tdo.pin : (uint)cjtag_tdi.pin;
	uint tdo_pin = swap_data ? (uint)cjtag_tdi.pin : (uint)cjtag_tdo.pin;
	int ret = jtag_apply_data_pins(tdi_pin, tdo_pin);

	if (ret == 0) {
		g_ctx.data_pins_swapped = swap_data;
	}
	return ret;
}

static int jtag_config_known_data_map(void)
{
	int ret;

	ret = jtag_apply_data_pins((uint)cjtag_tdi.pin, (uint)cjtag_tdo.pin);
	if (ret == 0) {
		g_ctx.data_pins_swapped = false;
	}
	return ret;
}

static const uint8_t state_transitions[16][2] = {
	[JTAG_TLR] = { JTAG_RTI, JTAG_TLR },
	[JTAG_RTI] = { JTAG_RTI, JTAG_SD },
	[JTAG_SD] = { JTAG_CD, JTAG_SI },
	[JTAG_CD] = { JTAG_SHD, JTAG_E1D },
	[JTAG_SHD] = { JTAG_SHD, JTAG_E1D },
	[JTAG_E1D] = { JTAG_PD, JTAG_UD },
	[JTAG_PD] = { JTAG_PD, JTAG_E2D },
	[JTAG_E2D] = { JTAG_SHD, JTAG_UD },
	[JTAG_UD] = { JTAG_RTI, JTAG_SD },
	[JTAG_SI] = { JTAG_CI, JTAG_TLR },
	[JTAG_CI] = { JTAG_SHI, JTAG_E1I },
	[JTAG_SHI] = { JTAG_SHI, JTAG_E1I },
	[JTAG_E1I] = { JTAG_PI, JTAG_UI },
	[JTAG_PI] = { JTAG_PI, JTAG_E2I },
	[JTAG_E2I] = { JTAG_SHI, JTAG_UI },
	[JTAG_UI] = { JTAG_RTI, JTAG_SD },
};

static int jtag_pin_setup(void)
{
	g_ctx.tck = cjtag_tck;
	g_ctx.tms = cjtag_tms;
	g_ctx.reset_a = cc1352_reset_a;
	g_ctx.reset_b = cc1352_reset_b;
	g_ctx.tck_pin = (uint)g_ctx.tck.pin;
	g_ctx.tms_pin = (uint)g_ctx.tms.pin;
	g_ctx.tck_mask = 1u << g_ctx.tck_pin;
	g_ctx.tms_mask = 1u << g_ctx.tms_pin;
	g_ctx.reset_a_pin = (uint)g_ctx.reset_a.pin;
	g_ctx.reset_b_pin = (uint)g_ctx.reset_b.pin;

	if (!device_is_ready(g_ctx.tck.port) || !device_is_ready(g_ctx.tms.port) ||
	    !device_is_ready(cjtag_tdi.port) || !device_is_ready(cjtag_tdo.port) ||
	    !device_is_ready(g_ctx.reset_a.port) ||
	    !device_is_ready(g_ctx.reset_b.port)) {
		return -ENODEV;
	}

	gpio_init(g_ctx.tck_pin);
	gpio_set_function(g_ctx.tck_pin, GPIO_FUNC_SIO);
	gpio_pull_up(g_ctx.tck_pin);
	gpio_set_input_enabled(g_ctx.tck_pin, false);
	gpio_set_dir(g_ctx.tck_pin, GPIO_OUT);
	gpio_put(g_ctx.tck_pin, 1);

	gpio_init(g_ctx.tms_pin);
	gpio_set_function(g_ctx.tms_pin, GPIO_FUNC_SIO);
	gpio_pull_up(g_ctx.tms_pin);
	gpio_set_input_enabled(g_ctx.tms_pin, false);
	gpio_set_dir(g_ctx.tms_pin, GPIO_OUT);
	gpio_put(g_ctx.tms_pin, 1);

	if (jtag_config_data_pins(false) < 0) {
		return -EIO;
	}

	jtag_select_reset_source(0);

	g_ctx.pins_ready = true;
	return 0;
}

