ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/cc1352_jtag.c
static int jtag_apply_ctrl_pins(uint tck_pin, uint tms_pin)
{
	if (tck_pin == tms_pin) {
		return -EINVAL;
	}

	g_ctx.tck_pin = tck_pin;
	g_ctx.tms_pin = tms_pin;
	g_ctx.tck_mask = 1u << g_ctx.tck_pin;
	g_ctx.tms_mask = 1u << g_ctx.tms_pin;

	gpio_init(g_ctx.tck_pin);
	gpio_set_function(g_ctx.tck_pin, GPIO_FUNC_SIO);
	gpio_pull_up(g_ctx.tck_pin);
	gpio_set_input_enabled(g_ctx.tck_pin, false);
	gpio_set_dir(g_ctx.tck_pin, GPIO_OUT);
	gpio_put(g_ctx.tck_pin, 1);

	gpio_init(g_ctx.tms_pin);
	gpio_set_function(g_ctx.tms_pin, GPIO_FUNC_SIO);
	gpio_pull_up(g_ctx.tms_pin);
	gpio_set_input_enabled(g_ctx.tms_pin, false);
	gpio_set_dir(g_ctx.tms_pin, GPIO_OUT);
	gpio_put(g_ctx.tms_pin, 1);

	return 0;
}

static inline void jtag_idle_lines(void)
{
	sio_hw->gpio_set = g_ctx.tck_mask | g_ctx.tms_mask | g_ctx.tdi_mask;
}

static inline void cc1352_set_reset_asserted(bool asserted, bool active_low)
{
	int level = asserted ? (active_low ? 0 : 1) : (active_low ? 1 : 0);

	gpio_put(g_ctx.reset_ctrl_pin, level);
	g_ctx.reset_ctrl_out_level = (uint8_t)level;
}

static void cc1352_reset_pulse_ms(int low_ms, int high_ms, bool active_low)
{
	cc1352_set_reset_asserted(true, active_low);
	k_msleep(low_ms);
	cc1352_set_reset_asserted(false, active_low);
	k_msleep(high_ms);
}

static void cc1352_release_reset_ms(int high_ms, bool active_low)
{
	cc1352_set_reset_asserted(false, active_low);
	k_msleep(high_ms);
}

static void cc1352_force_release_reset(void)
{
	/* Board design and existing firmware use active-low CC1352 reset. */
	gpio_put(g_ctx.reset_ctrl_pin, 1);
}

static uint8_t cc1352_read_reset_ctrl_level(void)
{
	return g_ctx.pins_ready ? g_ctx.reset_ctrl_out_level : 0;
}

static uint8_t cc1352_read_reset_obs_level(void)
{
	return g_ctx.pins_ready ? (gpio_get(g_ctx.reset_obs_pin) ? 1 : 0) : 0;
}

static void cc1352_drive_reset_obs_output(uint8_t level)
{
	if (!g_ctx.pins_ready) {
		return;
	}

	gpio_init(g_ctx.reset_obs_pin);
	gpio_set_function(g_ctx.reset_obs_pin, GPIO_FUNC_SIO);
	gpio_disable_pulls(g_ctx.reset_obs_pin);
	gpio_set_input_enabled(g_ctx.reset_obs_pin, false);
	gpio_set_dir(g_ctx.reset_obs_pin, GPIO_OUT);
	gpio_put(g_ctx.reset_obs_pin, level ? 1 : 0);
}

static void cc1352_restore_reset_obs_input(void)
{
	if (!g_ctx.pins_ready) {
		return;
	}

	gpio_init(g_ctx.reset_obs_pin);
	gpio_set_function(g_ctx.reset_obs_pin, GPIO_FUNC_SIO);
	gpio_disable_pulls(g_ctx.reset_obs_pin);
	gpio_set_input_enabled(g_ctx.reset_obs_pin, true);
	gpio_set_dir(g_ctx.reset_obs_pin, GPIO_IN);
}

static void cc1352_reset_with_line_preset(bool drive_low, int low_ms, int high_ms,
					  bool active_low)
{
	if (drive_low) {
		gpio_put(g_ctx.tms_pin, 0);
		gpio_put(g_ctx.tdi_pin, 0);
		gpio_put(g_ctx.tck_pin, 0);
	} else {
		jtag_idle_lines();
	}

	cc1352_reset_pulse_ms(low_ms, high_ms, active_low);
}

static inline void jtag_clock_edge(int tms, int tdi)
{
	if (tms) {
		sio_hw->gpio_set = g_ctx.tms_mask;
	} else {
		sio_hw->gpio_clr = g_ctx.tms_mask;
	}
	if (tdi) {
		sio_hw->gpio_set = g_ctx.tdi_mask;
	} else {
		sio_hw->gpio_clr = g_ctx.tdi_mask;
	}
	sio_hw->gpio_clr = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
	k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
	sio_hw->gpio_set = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
	k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
	g_ctx.state = state_transitions[g_ctx.state][tms ? 1 : 0];
}

static inline int jtag_clock_edge_read_tdo(int tms, int tdi)
{
	int bit = 0;

	if (tms) {
		sio_hw->gpio_set = g_ctx.tms_mask;
	} else {
		sio_hw->gpio_clr = g_ctx.tms_mask;
	}
	if (tdi) {
		sio_hw->gpio_set = g_ctx.tdi_mask;
	} else {
		sio_hw->gpio_clr = g_ctx.tdi_mask;
	}
	sio_hw->gpio_clr = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
	k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
	bit = (sio_hw->gpio_in & g_ctx.tdo_mask) ? 1 : 0;
	sio_hw->gpio_set = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
	k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
	g_ctx.state = state_transitions[g_ctx.state][tms ? 1 : 0];
	return bit;
}

static void jtag_go_rti(void)
{
	for (int i = 0; i < 6; i++) {
		jtag_clock_edge(1, 1);
	}
	g_ctx.state = JTAG_TLR;
	jtag_clock_edge(0, 1);
	g_ctx.state = JTAG_RTI;
}

static void jtag_force_reset(void)
{
	jtag_idle_lines();
	jtag_go_rti();
}

static void jtag_runtest(int cycles)
{
	if (g_ctx.state != JTAG_RTI) {
		jtag_go_rti();
	}
	for (int i = 0; i < cycles; i++) {
		jtag_clock_edge(0, 0);
	}
}

static inline void fd_jtag_clock_raw(int tms, int tdi)
{
	if (tms) {
		sio_hw->gpio_set = g_ctx.tms_mask;
	} else {
		sio_hw->gpio_clr = g_ctx.tms_mask;
	}
	if (tdi) {
		sio_hw->gpio_set = g_ctx.tdi_mask;
	} else {
		sio_hw->gpio_clr = g_ctx.tdi_mask;
	}
	sio_hw->gpio_clr = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
	k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
	sio_hw->gpio_set = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
	k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
}

static inline void fd_jtag_run_tms_seq(const uint8_t *seq, size_t len)
{
	for (size_t i = 0; i < len; i++) {
		fd_jtag_clock_raw(seq[i] ? 1 : 0, 0);
	}
}

static inline void fd_jtag_goto_rti(void)
{
	for (int i = 0; i < 6; i++) {
		fd_jtag_clock_raw(1, 1);
	}
	fd_jtag_clock_raw(0, 1);
	g_ctx.state = JTAG_RTI;
}

static inline void fd_jtag_runtest(int cycles)
{
	for (int i = 0; i < cycles; i++) {
		fd_jtag_clock_raw(0, 1);
	}
}

static inline uint32_t fd_jtag_read_bits(int size)
{
	uint32_t value = 0;

	for (int i = 0; i < size; i++) {
		sio_hw->gpio_clr = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
		k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
		if (sio_hw->gpio_in & g_ctx.tdo_mask) {
			value |= (1u << i);
		}
		sio_hw->gpio_set = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
		k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
	}

	return value;
}

static inline uint32_t fd_jtag_write_bits(uint32_t value, int size)
{
	for (int i = 0; i < size; i++) {
		if (value & 1u) {
			sio_hw->gpio_set = g_ctx.tdi_mask;
		} else {
			sio_hw->gpio_clr = g_ctx.tdi_mask;
		}
		sio_hw->gpio_clr = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
		k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
		sio_hw->gpio_set = g_ctx.tck_mask;
#if JTAG_EDGE_DELAY_US > 0
		k_busy_wait(JTAG_EDGE_DELAY_US);
#endif
		value >>= 1;
	}

	return value;
}

static void fd_jtag_write_ir_single(uint32_t ir, int ir_len)
{
	/* FreeDAP dap_jtag_write_ir() for a single tap (ir_before=ir_after=0). */
	sio_hw->gpio_set = g_ctx.tms_mask;
	fd_jtag_clock_raw(1, 1); /* Select-DR-Scan */
	fd_jtag_clock_raw(1, 1); /* Select-IR-Scan */
	sio_hw->gpio_clr = g_ctx.tms_mask;
	fd_jtag_clock_raw(0, 1); /* Capture-IR */
	fd_jtag_clock_raw(0, 1); /* Shift-IR */

	ir = fd_jtag_write_bits(ir, ir_len - 1);

	sio_hw->gpio_set = g_ctx.tms_mask;
	(void)fd_jtag_write_bits(ir, 1); /* Exit1-IR */

	fd_jtag_clock_raw(1, 1); /* Update-IR */
	sio_hw->gpio_clr = g_ctx.tms_mask;
	fd_jtag_clock_raw(0, 1); /* Idle */
	sio_hw->gpio_set = g_ctx.tdi_mask;
}

static uint32_t fd_jtag_read_dr32_single(void)
{
	uint32_t data;

	/* FreeDAP dap_jtag_idcode() sequence for single selected tap. */
	sio_hw->gpio_set = g_ctx.tms_mask;
	fd_jtag_clock_raw(1, 1); /* Select-DR-Scan */
	sio_hw->gpio_clr = g_ctx.tms_mask;
	fd_jtag_clock_raw(0, 1); /* Capture-DR */
	fd_jtag_clock_raw(0, 1); /* Shift-DR */

	data = fd_jtag_read_bits(31);
	sio_hw->gpio_set = g_ctx.tms_mask;
	data |= (fd_jtag_read_bits(1) << 31); /* Exit1-DR */

	fd_jtag_clock_raw(1, 1); /* Update-DR */
	sio_hw->gpio_clr = g_ctx.tms_mask;
	fd_jtag_clock_raw(0, 1); /* Idle */
	sio_hw->gpio_set = g_ctx.tdi_mask;

