ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/cc1352_jtag.c
	return data;
}

static uint32_t fd_jtag_read_idcode_after_tlr(void)
{
	fd_jtag_goto_rti();
	fd_jtag_goto_rti();
	return fd_jtag_read_dr32_single();
}

static void jtag_goto_shift_ir(void)
{
	if (g_ctx.state != JTAG_RTI) {
		jtag_go_rti();
	}
	jtag_clock_edge(1, 1);
	jtag_clock_edge(1, 1);
	jtag_clock_edge(0, 1);
	jtag_clock_edge(0, 1);
}

static void jtag_goto_shift_dr(void)
{
	if (g_ctx.state != JTAG_RTI) {
		jtag_go_rti();
	}
	jtag_clock_edge(1, 1);
	jtag_clock_edge(0, 1);
	jtag_clock_edge(0, 1);
}

static bool jtag_pathmove(const enum jtag_state *path, size_t count, int tdi)
{
	if (!path || count < 1) {
		return false;
	}

	for (size_t i = 0; i < count; i++) {
		enum jtag_state next = path[i];
		int tms;

		if (state_transitions[g_ctx.state][0] == next) {
			tms = 0;
		} else if (state_transitions[g_ctx.state][1] == next) {
			tms = 1;
		} else {
			return false;
		}

		jtag_clock_edge(tms, tdi);
	}

	return true;
}

static uint64_t jtag_shift_bits(uint64_t out, int bits)
{
	uint64_t in = 0;

	for (int i = 0; i < bits; i++) {
		int tdi = (out >> i) & 1;
		int tms = (i == bits - 1) ? 1 : 0;
		int tdo = jtag_clock_edge_read_tdo(tms, tdi);
		in |= ((uint64_t)tdo << i);
	}

	jtag_clock_edge(1, 1);
	jtag_clock_edge(0, 1);
	return in;
}

static uint64_t jtag_shift_ir_raw(uint64_t ir, int bits)
{
	jtag_goto_shift_ir();
	return jtag_shift_bits(ir, bits);
}

static uint64_t jtag_shift_ir_from_drpause(uint64_t ir, int bits)
{
	static const enum jtag_state drpause_to_shift_ir[] = {
		JTAG_E2D, JTAG_UD, JTAG_SD, JTAG_SI, JTAG_CI, JTAG_SHI
	};

	if (g_ctx.state != JTAG_PD) {
		jtag_go_rti();
		jtag_goto_shift_ir();
		return jtag_shift_bits(ir, bits);
	}

	if (!jtag_pathmove(drpause_to_shift_ir, ARRAY_SIZE(drpause_to_shift_ir), 0)) {
		jtag_go_rti();
		jtag_goto_shift_ir();
	}
	return jtag_shift_bits(ir, bits);
}

static uint64_t jtag_shift_dr_raw(uint64_t dr, int bits)
{
	jtag_goto_shift_dr();
	return jtag_shift_bits(dr, bits);
}

static uint64_t chain_shift_ir(const struct chain_desc *chain, int target_tap,
			       uint64_t ir_value)
{
	int offset = 0;
	uint64_t out = 0;
	int total = 0;

	for (int i = 0; i < chain->taps; i++) {
		uint64_t bypass = (i == chain->jrc_index) ? IR_JRC_IF_BYPASS :
					       IR_ARM_BYPASS;
		uint64_t v = (i == target_tap) ? ir_value : bypass;
		out |= (v & ((1ull << chain->ir_len[i]) - 1ull)) << offset;
		offset += chain->ir_len[i];
		total += chain->ir_len[i];
	}

	return jtag_shift_ir_raw(out, total);
}

static uint64_t chain_shift_dr(const struct chain_desc *chain, int target_tap,
			       uint64_t dr_value, int dr_bits)
{
	int offset = 0;
	uint64_t out = 0;
	uint64_t in;
	int total = 0;

	for (int i = 0; i < chain->taps; i++) {
		if (i == target_tap) {
			out |= (dr_value & ((1ull << dr_bits) - 1ull)) << offset;
			offset += dr_bits;
			total += dr_bits;
		} else {
			out |= (1ull << offset);
			offset += 1;
			total += 1;
		}
	}

	in = jtag_shift_dr_raw(out, total);

	offset = 0;
	for (int i = 0; i < chain->taps; i++) {
		if (i == target_tap) {
			return (in >> offset) & ((1ull << dr_bits) - 1ull);
		}
		offset += (i == target_tap) ? dr_bits : 1;
	}

	return 0;
}

static uint32_t chain_read_idcode(const struct chain_desc *chain, int tap_index,
				  uint64_t ir_value)
{
	uint64_t in;

	chain_shift_ir(chain, tap_index, ir_value);
	in = chain_shift_dr(chain, tap_index, 0, 32);
	return (uint32_t)in;
}

static bool idcode_is_valid(uint32_t id)
{
	return (id != 0x00000000u) && (id != 0xffffffffu);
}

static bool jrc_id_matches(uint32_t id)
{
	return (id == CC1352_JRC_IDCODE_VAL) ||
	       ((id & CC1352_JRC_IDCODE_MASK) == CC1352_JRC_IDCODE_CORE);
}

static int detect_chain_after_enable(void)
{
	struct chain_desc a = {
		.taps = 2,
		.ir_len = { TAP_CPU_IRLEN, TAP_JRC_IRLEN },
		.cpu_index = 0,
		.jrc_index = 1,
	};
	struct chain_desc b = {
		.taps = 2,
		.ir_len = { TAP_JRC_IRLEN, TAP_CPU_IRLEN },
		.cpu_index = 1,
		.jrc_index = 0,
	};
	uint32_t jrc, cpu;

	jrc = chain_read_idcode(&a, a.jrc_index, IR_JRC_IDCODE);
	cpu = chain_read_idcode(&a, a.cpu_index, IR_ARM_IDCODE);
	if (jrc_id_matches(jrc) &&
	    (cpu == ARM_DAP_IDCODE_VAL || idcode_is_valid(cpu))) {
		g_ctx.chain = a;
		g_ctx.chain_detected = true;
		g_ctx.jrc_idcode = jrc;
		g_ctx.cpu_idcode = cpu;
		return 0;
	}

	jrc = chain_read_idcode(&b, b.jrc_index, IR_JRC_IDCODE);
	cpu = chain_read_idcode(&b, b.cpu_index, IR_ARM_IDCODE);
	if (jrc_id_matches(jrc) &&
	    (cpu == ARM_DAP_IDCODE_VAL || idcode_is_valid(cpu))) {
		g_ctx.chain = b;
		g_ctx.chain_detected = true;
		g_ctx.jrc_idcode = jrc;
		g_ctx.cpu_idcode = cpu;
		return 0;
	}

	return -ENODEV;
}

static uint32_t jrc_read_single_tap_idcode(void)
{
	jtag_go_rti();
	fd_jtag_write_ir_single(IR_JRC_IDCODE, TAP_JRC_IRLEN);
	return fd_jtag_read_dr32_single();
}

static uint32_t try_read_jrc_idcode(void)
{
	struct chain_desc a = {
		.taps = 2,
		.ir_len = { TAP_CPU_IRLEN, TAP_JRC_IRLEN },
		.cpu_index = 0,
		.jrc_index = 1,
	};
	struct chain_desc b = {
		.taps = 2,
		.ir_len = { TAP_JRC_IRLEN, TAP_CPU_IRLEN },
		.cpu_index = 1,
		.jrc_index = 0,
	};
	uint32_t id = 0;

	id = fd_jtag_read_idcode_after_tlr();
	if (jrc_id_matches(id)) {
		return id;
	}

	id = jrc_read_single_tap_idcode();
	if (jrc_id_matches(id)) {
		return id;
	}

	id = chain_read_idcode(&a, a.jrc_index, IR_JRC_IDCODE);
	if (jrc_id_matches(id)) {
		return id;
	}

	id = chain_read_idcode(&b, b.jrc_index, IR_JRC_IDCODE);
	if (jrc_id_matches(id)) {
		return id;
	}

	return 0;
}

static int ti_cjtag_to_4wire_sequence(void)
{
	/* Match OpenOCD ti-cjtag.cfg pathmove sequence exactly. */
	static const enum jtag_state runidle_to_drpause[] = {
		JTAG_SD, JTAG_CD, JTAG_E1D, JTAG_PD
	};
	static const enum jtag_state drpause_to_runidle[] = {
		JTAG_E2D, JTAG_UD, JTAG_RTI
	};
	static const enum jtag_state drpause_to_drshift_to_runidle[] = {
		JTAG_E2D, JTAG_SHD, JTAG_E1D, JTAG_UD, JTAG_RTI
	};
	static const enum jtag_state drpause_to_2bitdrshift_to_runidle[] = {
		JTAG_E2D, JTAG_SHD, JTAG_SHD, JTAG_E1D, JTAG_UD, JTAG_RTI
	};
	static const enum jtag_state drpause_to_2bitdrshift_to_drpause[] = {
		JTAG_E2D, JTAG_SHD, JTAG_SHD, JTAG_E1D, JTAG_PD
	};
	static const enum jtag_state drpause_to_1bitdrshift_to_drpause[] = {
		JTAG_E2D, JTAG_SHD, JTAG_E1D, JTAG_PD
	};

	jtag_go_rti();
	jtag_runtest(20);
	jtag_shift_ir_raw(IR_JRC_IF_BYPASS, TAP_JRC_IRLEN);

	if (!jtag_pathmove(runidle_to_drpause, ARRAY_SIZE(runidle_to_drpause), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(drpause_to_runidle, ARRAY_SIZE(drpause_to_runidle), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(runidle_to_drpause, ARRAY_SIZE(runidle_to_drpause), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(drpause_to_runidle, ARRAY_SIZE(drpause_to_runidle), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(runidle_to_drpause, ARRAY_SIZE(runidle_to_drpause), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(drpause_to_drshift_to_runidle,
			   ARRAY_SIZE(drpause_to_drshift_to_runidle), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(runidle_to_drpause, ARRAY_SIZE(runidle_to_drpause), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(drpause_to_2bitdrshift_to_runidle,
			   ARRAY_SIZE(drpause_to_2bitdrshift_to_runidle), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(runidle_to_drpause, ARRAY_SIZE(runidle_to_drpause), 1)) {
		return -EIO;
	}
	for (int i = 0; i < 4; i++) {
		if (!jtag_pathmove(drpause_to_2bitdrshift_to_drpause,
				   ARRAY_SIZE(drpause_to_2bitdrshift_to_drpause), 1)) {
			return -EIO;
		}
	}
	if (!jtag_pathmove(drpause_to_1bitdrshift_to_drpause,
			   ARRAY_SIZE(drpause_to_1bitdrshift_to_drpause), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(drpause_to_runidle, ARRAY_SIZE(drpause_to_runidle), 1)) {
		return -EIO;
	}
	if (!jtag_pathmove(runidle_to_drpause, ARRAY_SIZE(runidle_to_drpause), 1)) {
		return -EIO;
	}

