ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/cc1352_jtag.c
	jtag_shift_ir_from_drpause(IR_JRC_IF_BYPASS, TAP_JRC_IRLEN);
	jtag_shift_ir_raw(IR_JRC_IDCODE, TAP_JRC_IRLEN);

	g_ctx.switched_to_4wire = true;
	return 0;
}

static uint32_t icepick_router_write(uint8_t block, uint8_t reg, uint32_t payload)
{
	uint32_t val = BIT(31) | ((block & 0x7u) << 28) | ((reg & 0xfu) << 24) |
		       (payload & 0x00ffffffu);

	jtag_shift_ir_raw(IR_JRC_ROUTER, TAP_JRC_IRLEN);
	return (uint32_t)jtag_shift_dr_raw(val, 32);
}

static void icepick_enable_cpu_tap(void)
{
	jtag_shift_ir_raw(IR_JRC_CONNECT, TAP_JRC_IRLEN);
	jtag_shift_dr_raw(0x89, 8);

	icepick_router_write(0x0, 0x1, 0x001000);
	icepick_router_write(0x2, 0x0, 0x110048);
	icepick_router_write(0x2, 0x0, 0x112048);
	icepick_router_write(0x2, 0x0, 0x112148);

	jtag_shift_ir_raw(IR_JRC_BYPASS, TAP_JRC_IRLEN);
	for (int i = 0; i < 10; i++) {
		jtag_clock_edge(0, 1);
	}
	g_ctx.cpu_tap_enabled = true;
}

static int jtag_dpacc_apacc(bool apndp, bool rnw, uint8_t addr, uint32_t *data)
{
	uint8_t req = ((addr & 0xc) >> 2) << 2;
	uint64_t dr_out;
	uint64_t dr_in;
	uint8_t ack;

	req |= apndp ? 1 : 0;
	req |= rnw ? 2 : 0;

	chain_shift_ir(&g_ctx.chain, g_ctx.chain.cpu_index,
		       apndp ? IR_ARM_APACC : IR_ARM_DPACC);

	dr_out = req & 0x7;
	if (!rnw && data) {
		dr_out |= ((uint64_t)(*data) << 3);
	}
	dr_in = chain_shift_dr(&g_ctx.chain, g_ctx.chain.cpu_index, dr_out, 35);
	ack = dr_in & 0x7;
	if (ack != 0x2) {
		return -EIO;
	}

	if (rnw && data) {
		*data = (uint32_t)(dr_in >> 3);
	}

	return 0;
}

static int dp_write(uint8_t addr, uint32_t value)
{
	return jtag_dpacc_apacc(false, false, addr, &value);
}

static int dp_read(uint8_t addr, uint32_t *value)
{
	uint32_t dummy = 0;
	int ret;

	ret = jtag_dpacc_apacc(false, true, addr, &dummy);
	if (ret < 0) {
		return ret;
	}
	return jtag_dpacc_apacc(false, true, DP_ADDR_RDBUFF, value);
}

static int ap_write(uint8_t addr, uint32_t value)
{
	uint32_t select = addr & 0xf0;
	int ret;

	ret = dp_write(DP_ADDR_SELECT, select);
	if (ret < 0) {
		return ret;
	}
	return jtag_dpacc_apacc(true, false, addr, &value);
}

static int ap_read(uint8_t addr, uint32_t *value)
{
	uint32_t select = addr & 0xf0;
	uint32_t dummy = 0;
	int ret;

	ret = dp_write(DP_ADDR_SELECT, select);
	if (ret < 0) {
		return ret;
	}
	ret = jtag_dpacc_apacc(true, true, addr, &dummy);
	if (ret < 0) {
		return ret;
	}
	return jtag_dpacc_apacc(false, true, DP_ADDR_RDBUFF, value);
}

static int memap_write32(uint32_t addr, uint32_t value)
{
	int ret;

	ret = ap_write(AP_ADDR_CSW, 0x23000052);
	if (ret < 0) {
		return ret;
	}
	ret = ap_write(AP_ADDR_TAR, addr);
	if (ret < 0) {
		return ret;
	}
	return ap_write(AP_ADDR_DRW, value);
}

static int memap_read32(uint32_t addr, uint32_t *value)
{
	int ret;

	ret = ap_write(AP_ADDR_CSW, 0x23000052);
	if (ret < 0) {
		return ret;
	}
	ret = ap_write(AP_ADDR_TAR, addr);
	if (ret < 0) {
		return ret;
	}
	return ap_read(AP_ADDR_DRW, value);
}

static int dp_power_up(void)
{
	uint32_t ctrl;
	int ret;

	ret = dp_write(DP_ADDR_ABORT, 0x1e);
	if (ret < 0) {
		return ret;
	}

	ret = dp_write(DP_ADDR_CTRLSTAT, CTRLSTAT_CSYSPWRUPREQ | CTRLSTAT_CDBGPWRUPREQ);
	if (ret < 0) {
		return ret;
	}

	for (int i = 0; i < 20; i++) {
		ret = dp_read(DP_ADDR_CTRLSTAT, &ctrl);
		if (ret < 0) {
			return ret;
		}
		if ((ctrl & (CTRLSTAT_CSYSPWRUPACK | CTRLSTAT_CDBGPWRUPACK)) ==
		    (CTRLSTAT_CSYSPWRUPACK | CTRLSTAT_CDBGPWRUPACK)) {
			return 0;
		}
		k_msleep(5);
	}

	return -ETIMEDOUT;
}

int cc1352_jtag_init_sequence(void)
{
	int ret;
	uint32_t jrc_id = 0;
	bool found_jrc = false;
	static const uint8_t data_pairs[][2] = {
		{ 13, 14 },
		{ 14, 13 },
	};
	static const uint8_t reset_sources[] = { 0, 1 };
	static const uint8_t aux_levels[] = { 0, 1 };

	if (!g_ctx.pins_ready) {
		ret = jtag_pin_setup();
		if (ret < 0) {
			return ret;
		}
	}

	/* Fixed baseline state */
	g_ctx.switched_to_4wire = false;
	g_ctx.cpu_tap_enabled = false;
	g_ctx.chain_detected = false;
	g_ctx.chain.taps = 0;
	g_ctx.chain.cpu_index = 0;
	g_ctx.chain.jrc_index = 0;
	g_ctx.jrc_idcode = 0;
	g_ctx.cpu_idcode = 0;
	g_ctx.last_dhcsr = 0;
	g_ctx.reset_active_low = true;
	ret = jtag_apply_ctrl_pins((uint)cjtag_tck.pin, (uint)cjtag_tms.pin);
	if (ret < 0) {
		return ret;
	}

	ret = jtag_config_known_data_map();
	if (ret < 0) {
		return ret;
	}
	g_ctx.data_pins_swapped = false;

	/*
	 * Match free-dap RP2040 mapping:
	 * TCK=11, TMS=12, TDI=13, TDO=14, nRESET=15.
	 */
	/* Stage 1: detect JRC using plain 4-wire first, TI sequence as fallback. */
	for (size_t rs = 0; rs < ARRAY_SIZE(reset_sources) && !found_jrc; rs++) {
		for (size_t al = 0; al < ARRAY_SIZE(aux_levels) && !found_jrc; al++) {
			ret = jtag_select_reset_source(reset_sources[rs]);
			if (ret < 0) {
				continue;
			}
			g_ctx.reset_active_low = true;
			cc1352_force_release_reset();
			cc1352_drive_reset_obs_output(aux_levels[al]);
			k_msleep(20);
			jtag_idle_lines();

			for (size_t dp = 0; dp < ARRAY_SIZE(data_pairs) && !found_jrc; dp++) {
				ret = jtag_apply_data_pins(data_pairs[dp][0], data_pairs[dp][1]);
				if (ret < 0) {
					continue;
				}
				g_ctx.data_pins_swapped = (data_pairs[dp][0] != 13);

				for (int pass = 0; pass < 4 && !found_jrc; pass++) {
					{
						unsigned int key = irq_lock();
						g_ctx.state = JTAG_TLR;
						jrc_id = try_read_jrc_idcode();
						ret = (jrc_id != 0) ? 0 : -ENODEV;
						if (ret < 0) {
							ret = ti_cjtag_to_4wire_sequence();
							if (ret == 0) {
								jrc_id = try_read_jrc_idcode();
								ret = (jrc_id != 0) ? 0 : -ENODEV;
							}
						}
						irq_unlock(key);
					}

					if (ret == 0 && jrc_id_matches(jrc_id)) {
						found_jrc = true;
						g_ctx.jrc_idcode = jrc_id;
						break;
					}

					cc1352_reset_pulse_ms(80, 80, true);
					jtag_idle_lines();
				}
			}
		}
	}

	if (!found_jrc) {
		jtag_select_reset_source(0);
		cc1352_restore_reset_obs_input();
		jtag_apply_ctrl_pins((uint)cjtag_tck.pin, (uint)cjtag_tms.pin);
		jtag_config_data_pins(false);
		g_ctx.reset_active_low = true;
		cc1352_force_release_reset();
		return -ENODEV;
	}

