ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/cc1352_jtag.c
	g_ctx.switched_to_4wire = true;

	/* Stage 2: with verified JRC path, enable CPU TAP and detect chain. */
	{
		unsigned int key = irq_lock();
		icepick_enable_cpu_tap();
		ret = detect_chain_after_enable();
		irq_unlock(key);
	}

	jtag_select_reset_source(0);
	cc1352_restore_reset_obs_input();
	jtag_apply_ctrl_pins((uint)cjtag_tck.pin, (uint)cjtag_tms.pin);
	jtag_config_data_pins(false);
	g_ctx.reset_active_low = true;
	cc1352_force_release_reset();
	return ret;
}

int cc1352_jtag_read_idcodes(uint32_t *jrc_id, uint32_t *cpu_id)
{
	int ret;

	if (!g_ctx.chain_detected) {
		ret = cc1352_jtag_init_sequence();
		if (ret < 0) {
			return ret;
		}
	}

	g_ctx.jrc_idcode = chain_read_idcode(&g_ctx.chain, g_ctx.chain.jrc_index,
					     IR_JRC_IDCODE);
	g_ctx.cpu_idcode = chain_read_idcode(&g_ctx.chain, g_ctx.chain.cpu_index,
					     IR_ARM_IDCODE);

	if (jrc_id) {
		*jrc_id = g_ctx.jrc_idcode;
	}
	if (cpu_id) {
		*cpu_id = g_ctx.cpu_idcode;
	}

	return 0;
}

int cc1352_jtag_halt_cpu(uint32_t *dhcsr_out)
{
	uint32_t dhcsr = 0;
	int ret;

	if (!g_ctx.chain_detected) {
		ret = cc1352_jtag_init_sequence();
		if (ret < 0) {
			return ret;
		}
	}

	ret = dp_power_up();
	if (ret < 0) {
		return ret;
	}

	ret = memap_write32(DHCSR_ADDR, DHCSR_DBGKEY | DHCSR_C_DEBUGEN | DHCSR_C_HALT);
	if (ret < 0) {
		return ret;
	}

	ret = memap_read32(DHCSR_ADDR, &dhcsr);
	if (ret < 0) {
		return ret;
	}

	g_ctx.last_dhcsr = dhcsr;
	if (dhcsr_out) {
		*dhcsr_out = dhcsr;
	}

	if ((dhcsr & DHCSR_S_HALT) == 0) {
		return -EAGAIN;
	}

	return 0;
}

void cc1352_jtag_get_status(struct cc1352_jtag_status *status)
{
	if (!status) {
		return;
	}

	status->pins_ready = g_ctx.pins_ready;
	status->switched_to_4wire = g_ctx.switched_to_4wire;
	status->cpu_tap_enabled = g_ctx.cpu_tap_enabled;
	status->chain_detected = g_ctx.chain_detected;
	status->chain_taps = g_ctx.chain.taps;
	status->cpu_tap_index = g_ctx.chain.cpu_index;
	status->jrc_tap_index = g_ctx.chain.jrc_index;
	status->jrc_idcode = g_ctx.jrc_idcode;
	status->cpu_idcode = g_ctx.cpu_idcode;
	status->last_dhcsr = g_ctx.last_dhcsr;
	status->data_pins_swapped = g_ctx.data_pins_swapped;
	status->reset_active_low = g_ctx.reset_active_low;
	status->reset_ctrl_level = cc1352_read_reset_ctrl_level();
	status->reset_obs_level = cc1352_read_reset_obs_level();
	status->reset_source = g_ctx.reset_source;
	status->tck_pin = (uint8_t)g_ctx.tck_pin;
	status->tms_pin = (uint8_t)g_ctx.tms_pin;
	status->tdi_pin = (uint8_t)g_ctx.tdi_pin;
	status->tdo_pin = (uint8_t)g_ctx.tdo_pin;
}

int cc1352_jtag_diag_probe(struct cc1352_jtag_diag *diag)
{
	int ret;

	if (!diag) {
		return -EINVAL;
	}

	if (!g_ctx.pins_ready) {
		ret = jtag_pin_setup();
		if (ret < 0) {
			return ret;
		}
	}

	for (int map = 0; map < 2; map++) {
		jtag_select_reset_source(1);
		g_ctx.reset_active_low = true;
		ret = jtag_config_data_pins(map == 1);
		if (ret < 0) {
			return ret;
		}

		/* Check if selected TDO input is actually driven by target. */
		gpio_set_pulls(g_ctx.tdo_pin, true, false);
		k_msleep(1);
		diag->tdo_pull_up_level[map] = gpio_get(g_ctx.tdo_pin) ? 1 : 0;

		gpio_set_pulls(g_ctx.tdo_pin, false, true);
		k_msleep(1);
		diag->tdo_pull_down_level[map] =
			gpio_get(g_ctx.tdo_pin) ? 1 : 0;

		gpio_disable_pulls(g_ctx.tdo_pin);

		cc1352_release_reset_ms(20, true);
		k_msleep(5);
		jtag_idle_lines();
		{
			unsigned int key = irq_lock();
			g_ctx.state = JTAG_TLR;
			diag->direct_jrc_id[map] = fd_jtag_read_idcode_after_tlr();
			irq_unlock(key);
		}

		cc1352_release_reset_ms(20, true);
		k_msleep(5);
		jtag_idle_lines();
		{
			unsigned int key = irq_lock();
			g_ctx.state = JTAG_RTI;
			ret = ti_cjtag_to_4wire_sequence();
			if (ret == 0) {
				ret = ti_cjtag_to_4wire_sequence();
			}
			diag->switched_jrc_id[map] =
				(ret == 0) ? jrc_read_single_tap_idcode() : 0;
			irq_unlock(key);
		}
	}

	jtag_select_reset_source(1);
	g_ctx.reset_active_low = true;
	jtag_config_data_pins(false);
	cc1352_force_release_reset();
	return 0;
}

const char *cc1352_jtag_strerror(int err)
{
	switch (-err) {
	case 0:
		return "OK";
	case ENODEV:
		return "JTAG target not found";
	case EIO:
		return "JTAG-DP/AP transfer failed";
	case ETIMEDOUT:
		return "DAP power-up timeout";
	case EAGAIN:
		return "CPU did not enter halt state";
	default:
		return "JTAG operation failed";
	}
}
